app/Controllers/Auth.php

    public function register(): string|\CodeIgniter\HTTP\RedirectResponse {
        // Already logged in
        if (session()->get('user_id')) return redirect()->to(base_url());

        $error = null;

        if ($this->request->is('post')) {
            $username = trim($this->request->getPost('username') ?? '');
            $email    = trim($this->request->getPost('email') ?? '');
            $password = $this->request->getPost('password') ?? '';
            $confirm  = $this->request->getPost('confirm') ?? '';

            if (!$username || !$email || strlen($password) < 6) {
                $error = 'Please fill all fields. Password must be at least 6 characters.';
            } elseif ($password !== $confirm) {
                $error = 'Passwords do not match.';
            } elseif ($this->userModel->findByEmail($email)) {
                $error = 'An account with that email already exists.';
            } elseif ($this->userModel->where('username', $username)->countAllResults() > 0) {
                $error = 'That username is already taken.';
            } else {
                $colors = ['#f59e0b','#3b82f6','#10b981','#ef4444','#8b5cf6','#f97316'];
                $color  = $colors[array_rand($colors)];

                $id = $this->userModel->insert([
                    'username'      => $username,
                    'email'         => $email,
                    'password_hash' => password_hash($password, PASSWORD_DEFAULT),
                    'avatar_color'  => $color,
                ]);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `username` = 'aakazz'
INSERT INTO `users` (`username`, `email`, `password_hash`, `avatar_color`) VALUES ('aakazz', 'aakash310@hotmail.com', '$2y$12$h.9tFWInA7Pe/TmALtgvke27URjMMqomE4d1sTWYoGoFrr8VjGnRy', '#f59e0b')