app/Controllers/Home.php

SELECT COUNT(*) AS `numrows` FROM `places`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `city`
FROM `places`
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `country`
FROM `places`
) CI_count_all_results
---
    public function index(): string {
        $db       = \Config\Database::connect();
        $featured = $this->places->getFeatured(8);
        $categories = $this->categories->allWithCount();
        $stats = [
            'places'    => $db->table('places')->countAll(),
            'cities'    => $db->table('places')->select('city')->distinct()->countAllResults(),
            'countries' => $db->table('places')->select('country')->distinct()->countAllResults(),
        ];