app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = 4
SELECT COUNT(*) AS `numrows`
FROM `reviews`
WHERE `user_id` = 4
SELECT COUNT(*) AS `numrows`
FROM `recently_viewed`
WHERE `user_id` = 4
SELECT `r`.*, `p`.`name` AS `place_name`, `p`.`id` AS `place_id`, `p`.`photo_url`, `c`.`name` AS `category_name`, `c`.`color` AS `category_color`, `c`.`icon` AS `category_icon`
FROM `reviews` `r`
LEFT JOIN `places` `p` ON `p`.`id` = `r`.`place_id`
LEFT JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
WHERE `r`.`user_id` = 4
ORDER BY `r`.`created_at` DESC
SELECT `p`.*, `c`.`name` AS `category_name`, `c`.`color` AS `category_color`, `c`.`icon` AS `category_icon`, `c`.`slug` AS `category_slug`, `rv`.`viewed_at`, IFNULL(AVG(r2.rating), 0) AS avg_rating, COUNT(r2.id) AS review_count
FROM `recently_viewed` `rv`
LEFT JOIN `places` `p` ON `p`.`id` = `rv`.`place_id`
LEFT JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
LEFT JOIN `reviews` `r2` ON `r2`.`place_id` = `p`.`id`
WHERE `rv`.`user_id` = 4
GROUP BY `rv`.`id`
ORDER BY `rv`.`viewed_at` DESC
 LIMIT 12
---
    public function index(): string|\CodeIgniter\HTTP\RedirectResponse {
        if ($r = $this->requireLogin()) return $r;

        $db     = \Config\Database::connect();
        $userId = session()->get('user_id');
        $user   = $this->userModel->find($userId);

        // Stats
        $reviewCount  = $db->table('reviews')->where('user_id', $userId)->countAllResults();
        $visitedCount = $db->table('recently_viewed')->where('user_id', $userId)->countAllResults();

        // My reviews with place info
        $reviews = $db->table('reviews r')
            ->select('r.*, p.name AS place_name, p.id AS place_id, p.photo_url,
                      c.name AS category_name, c.color AS category_color, c.icon AS category_icon')
            ->join('places p', 'p.id = r.place_id', 'left')
            ->join('categories c', 'c.id = p.category_id', 'left')
            ->where('r.user_id', $userId)
            ->orderBy('r.created_at', 'DESC')
            ->get()->getResultArray();

        // Recently viewed places
        $recentlyViewed = $db->table('recently_viewed rv')
            ->select('p.*, c.name AS category_name, c.color AS category_color,
                      c.icon AS category_icon, c.slug AS category_slug,
                      rv.viewed_at,
                      IFNULL(AVG(r2.rating),0) AS avg_rating,
                      COUNT(r2.id) AS review_count')
            ->join('places p', 'p.id = rv.place_id', 'left')
            ->join('categories c', 'c.id = p.category_id', 'left')
            ->join('reviews r2', 'r2.place_id = p.id', 'left')
            ->where('rv.user_id', $userId)
            ->groupBy('rv.id, rv.viewed_at')
            ->orderBy('rv.viewed_at', 'DESC')
            ->limit(12)
            ->get()->getResultArray();