app/Models/CategoryModel.php

SELECT `c`.*, COUNT(p.id) AS place_count
FROM `categories` `c`
LEFT JOIN `places` `p` ON `p`.`category_id` = `c`.`id`
GROUP BY `c`.`id`
ORDER BY `c`.`name` ASC
---
    public function allWithCount(): array {
        return $this->db->table('categories c')
            ->select('c.*, COUNT(p.id) AS place_count')
            ->join('places p','p.category_id = c.id','left')
            ->groupBy('c.id')
            ->orderBy('c.name','ASC')
            ->get()->getResultArray();