app/Models/PlaceModel.php

SELECT COUNT(*) AS `numrows`
FROM `places` `p`
LEFT JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
---
    public function countFiltered(string $category='', string $search=''): int {
        $q = $this->db->table('places p')->join('categories c','c.id = p.category_id','left');
        if ($category && $category !== 'all') $q->where('c.slug', $category);
        if ($search) {
            $q->groupStart()
              ->like('p.name',$search)->orLike('p.city',$search)
              ->orLike('p.tags',$search)->orLike('p.country',$search)
              ->groupEnd();
        }
        return (int)$q->countAllResults();