app/Models/ReviewModel.php

SELECT `r`.*, `u`.`username`, `u`.`avatar_color`
FROM `reviews` `r`
LEFT JOIN `users` `u` ON `u`.`id` = `r`.`user_id`
WHERE `r`.`place_id` = 28
ORDER BY `r`.`created_at` DESC
---
    public function getForPlace(int $placeId): array {
        return $this->db->table('reviews r')
            ->select('r.*, u.username, u.avatar_color')
            ->join('users u','u.id = r.user_id','left')
            ->where('r.place_id', $placeId)
            ->orderBy('r.created_at','DESC')
            ->get()->getResultArray();

SELECT `rating`, COUNT(*) AS cnt
FROM `reviews`
WHERE `place_id` = 28
GROUP BY `rating`
---
    public function getRatingBreakdown(int $placeId): array {
        $rows = $this->db->table('reviews')
            ->select('rating, COUNT(*) AS cnt')
            ->where('place_id', $placeId)
            ->groupBy('rating')
            ->get()->getResultArray();