app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'aakash310@hotmail.com'
 LIMIT 1
---
    public function findByEmail(string $email): ?array {
        return $this->where('email', $email)->first();